<?php

namespace Database\Seeders;

use App\Models\News\News;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        News::create([
            "news_category_id" => 1,
            "title" => "বৃত্তি নিয়ে বিদেশে পড়তে যাওয়ার আগ্রহ বেশি শিক্ষার্থীদের । এর কারণ হিসেবে কি দেখছে বিশ্লেষকরা ?",
            "description" => "উচ্চশিক্ষার জন্য দেশের বাইরে পড়তে যান অনেকেই। কেউ বৃত্তি পেয়ে, কেউ নিজ পকেটের অর্থ খরচ করে পড়াশোনা করেন। বিদেশে পড়ার সময়ে অর্থ কীভাবে খরচ করতে হবে, তার একটি পরিকল্পনা দরকার। কারণ, অর্থের অপচয় বা অযথা ব্যয় বিপদে ফেলতে পারে শিক্ষার্থীদের। প্রথমবার বিদেশে পড়তে যাওয়া শিক্ষার্থীদের অর্থ ব্যয় বা অর্থ ব্যবস্থাপনা নিয়ে নানান ঝক্কিঝামেলায় পড়তে হয়। এখানে কিছু পরামর্শ দেওয়া হলো।

            উচ্চশিক্ষার জন্য দেশের বাইরে পড়তে যান অনেকেই। কেউ বৃত্তি পেয়ে, কেউ নিজ পকেটের অর্থ খরচ করে পড়াশোনা করেন। বিদেশে পড়ার সময়ে অর্থ কীভাবে খরচ করতে হবে, তার একটি পরিকল্পনা দরকার। কারণ, অর্থের অপচয় বা অযথা ব্যয় বিপদে ফেলতে পারে শিক্ষার্থীদের। প্রথমবার বিদেশে পড়তে যাওয়া শিক্ষার্থীদের অর্থ ব্যয় বা অর্থ ব্যবস্থাপনা নিয়ে নানান ঝক্কিঝামেলায় পড়তে হয়। এখানে কিছু পরামর্শ দেওয়া হলো।

            উচ্চশিক্ষার জন্য দেশের বাইরে পড়তে যান অনেকেই। কেউ বৃত্তি পেয়ে, কেউ নিজ পকেটের অর্থ খরচ করে পড়াশোনা করেন। বিদেশে পড়ার সময়ে অর্থ কীভাবে খরচ করতে হবে, তার একটি পরিকল্পনা দরকার। কারণ, অর্থের অপচয় বা অযথা ব্যয় বিপদে ফেলতে পারে শিক্ষার্থীদের। প্রথমবার বিদেশে পড়তে যাওয়া শিক্ষার্থীদের অর্থ ব্যয় বা অর্থ ব্যবস্থাপনা নিয়ে নানান ঝক্কিঝামেলায় পড়তে হয়। এখানে কিছু পরামর্শ দেওয়া হলো।

            উচ্চশিক্ষার জন্য দেশের বাইরে পড়তে যান অনেকেই। কেউ বৃত্তি পেয়ে, কেউ নিজ পকেটের অর্থ খরচ করে পড়াশোনা করেন। বিদেশে পড়ার সময়ে অর্থ কীভাবে খরচ করতে হবে, তার একটি পরিকল্পনা দরকার। কারণ, অর্থের অপচয় বা অযথা ব্যয় বিপদে ফেলতে পারে শিক্ষার্থীদের। প্রথমবার বিদেশে পড়তে যাওয়া শিক্ষার্থীদের অর্থ ব্যয় বা অর্থ ব্যবস্থাপনা নিয়ে নানান ঝক্কিঝামেলায় পড়তে হয়। এখানে কিছু পরামর্শ দেওয়া হলো।",
            "image" => "/assets/images/news_img/img1.jpg"
        ]);
    }
}
